// 7. Написати умовну конструкцію, яка в залежності від часу доби
// виводитиме відповідне привітання. Потрібно отримати реальний час доби
// із системи. Зробити 2 способами через 2 різних умовних оператора.
//
// В діапазоні годин 23-5 – має виводитися привітання “Доброї ночі”
// В діапазоні годин 5-11 – має виводитися привітання “Доброго ранку”
// В діапазоні годин 11-17 – має виводитися привітання “Доброго дня”
// В діапазоні годин 17-23 – має виводитися привітання “Доброго вечора”.

let today = new Date();
let h = today.getHours();

if (h >= 23 && h < 5 ) { console.log('Доброї ночі');    }
if (h >= 5  && h < 11) { console.log('Доброго ранку');  }
if (h >= 11 && h < 17) { console.log('Доброго дня');    }
if (h >= 17 && h < 23) { console.log('Доброго вечора'); }

// оптимізованіше
if      (h >= 23 && h < 5 ) { console.log('Доброї ночі');    }
else if (h >= 5  && h < 11) { console.log('Доброго ранку');  }
else if (h >= 11 && h < 17) { console.log('Доброго дня');    }
else if (h >= 17 && h < 23) { console.log('Доброго вечора'); }
