// 3. Створіть порожній масив;
// 1) У перший елемент масиву запишіть будь-яке число;
// 2) У другий елемент масиву запишіть будь-який рядок;
// 3) У третій елемент масиву запишіть будь-яке логічне значення;
// 4) У четвертий елемент масиву запишіть значення null;
// 5) Виведіть на екран число елементів, яке зберігається в масиві;
// 6) Запитайте у користувача ввести будь-яке значення і запишіть це значення в п'ятий елемент масиву;
// 7) Виведіть на екран п'ятий елемент масиву.
// 8) Видаліть 1-ий елемент масиву і виведіть масив на екран.

const arr = [];
arr[0] = 1;
arr[1] = 'some string';
arr[2] = true;
arr[3] = null;

console.log(arr.length);

let ask_user = 33; // prompt('Input data:');

arr.push(ask_user);
console.log(arr[4]);
arr.shift(0);
console.log(arr);
