// 6. Користувач вводить три довжини сторін трикутника (використовуйте
// prompt () три рази для введення кожної сторони).
// Необхідно 
// 	   a) визначити і вивести в консоль площу трикутника 
//         b) перевірити чи цей трикутник є прямокутним і вивести
//            в консоль результат перевірки.
// Здійснювати перевірку чи введені користувачем значення коректні, в
// іншому випадку вивести 'Incorrect data‘. Результат обчислення площі
// трикутника виводити в консоль з точністю 3 знаки після коми
// (наприклад: 8.42355465 => 8.424).


let a = prompt('Input a');
let b = prompt('Input b');
let c = prompt('Input c');

// Формула Герона
let p = (a + b + c) / 2;
let S = (p * (p-a) * (p-b) * (p-c)) ** (1/2);

console.log(S.toFixed(3));
